In [1]:
# Python Variable Name Rules
# Must start with a letter or underscore _
# Must consist of letters, numbers, and underscores
# Case Sensitive

In [6]:
a1 = 10
a1

10

In [ ]:
### Assign multiple values to multiple variables in a single line

In [9]:
a = 100
b = 200
c = 300
print(a)
print(b)

100
200

In [10]:
type(a)

int

In [11]:
c = 10.5
type(c)

float

In [12]:
d = True
type(d)

bool

In [13]:
var = "hai8797%%%4$$"
var1 = "hai8797%%%4$$"

In [15]:
# check type
type(var1)

str

In [17]:
### Assign same value to multiple variables
a = b = c = 900
c

900

In [22]:
# type
a = float(a)

In [23]:
type(a)

float

In [24]:
c = "10"
type(c)

str

In [27]:
c = int(c)

In [1]:
# convert to float or int

In [ ]:
# Print statements in different format

In [29]:
print("The value of a is:", a)

The value of a is: 900.0

In [32]:
print("The value's of a is {}".format(a))

The value's of a is 900.0

In [31]:
print(f"The value of a is :{a}")

The value of a is :900.0

In [20]:
# Assignment statement
x = 8
# Assignment with expression
x = x + 9
# Print statement
print(x)

17

In [33]:
# Arithmetic Operators
# Addition
print(3 + 4)
# Subtraction
print(3 - 4)
# Multiplication
print(3 * 4)
# modulo operator
print(3 % 2)
# Exponentiation
print(3**4)
#  division
print(7 / 4)
# floor division
print(7 // 4)

7
-1
12
1
81
1.75
1

In [34]:
a == b

True

In [37]:
b

900

In [39]:
not ((a < 10) or (b > 100))

False

#### Relational operators
Operator	                             Description	                                      Syntax
<	                               Less than: True if the left operand is less than the right	x < y
==	                               Equal to: True if both operands are equal	                x == y
!=	                               Not equal to – True if operands are not equal	            x != y
>=	                               Greater than or equal to: True if left operand is            x >= y
                                     greater than or equal to the right

Logical operators
Operator	             Description	                                              Example
and	             Returns True if both statements are true	                     x < 5 and x < 10
or	             Returns True if one of the statements is true	                 x < 5 or x < 4
not	             Reverse the result, returns False if the result is true 	     not(x < 5 and x < 10)

In [43]:
# Get string object '123' from user input function and add value 1.
inp1 = int(input("Enter a number"))

Enter a number123

In [44]:
type(inp1)

int

In [45]:
inp1 + 1

124

In [46]:
"123" + str(1)

'1231'

In [47]:
# if -else
inp1 = int(input())
if inp1 > 0:
    print("positive")
elif inp1 == 0:
    print("zero")
else:
    print("negative")

5
positive

In [51]:
# Find the largest of the 3 using if-else
a = int(input())
b = int(input())
c = int(input())
if (a > b) and (a > c):
    print(a)
elif (b > c) and (b > a):
    print(b)
else:
    print(c)

1
2000
3
2000

In [ ]:
# Iterating over range 0 to n-1
# Iterating over a String

In [54]:
for i in range(0, 5, 1):
    print(i)

0
1
2
3
4

In [55]:
for i in range(0, 5, 2):
    print(i)

0
2
4

In [53]:
for i in range(5):
    print(i)

0
1
2
3
4

In [56]:
# 5,4,3,2,1
for i in range(5, 0, -1):
    print(i)

5
4
3
2
1

In [ ]:
# Strings
# Strings are a collection of character where each character is again a string of length 1.
# Strings are immutable objects

In [60]:
sent = "We are learning Python"
sent[3]  # +ve index

'a'

In [63]:
sent[-3]  # -ve index

'h'

In [66]:
sent[0:6:1]

'We are'

In [68]:
sent[7:15:2]

'lann'

In [71]:
sent[-6:]

'Python'

In [72]:
sent[-6::2]

'Pto'

In [74]:
sent[-1:-7:-1]

'nohtyP'

In [75]:
# Reverse the string
sent[-1::-1]

'nohtyP gninrael era eW'

In [76]:
sent[::-1]

'nohtyP gninrael era eW'

In [43]:
# positive - left to right
# negative -  right to left
# start index - included
# end index - excluded

In [91]:
sent = "We are learning Python"

In [98]:
sent[-1:-7:-1]

'nohtyP'

In [77]:
# immutable
sent[0] = "p"

TypeError: 'str' object does not support item assignment

In [79]:
help(str.lower)

Help on method_descriptor:

lower(self, /)
    Return a copy of the string converted to lowercase.

In [80]:
"Hello".upper()

'HELLO'

In [85]:
s = "hello"
s = s.replace("h", "c")

In [86]:
s

'cello'

In [88]:
s.find("l")

2

In [90]:
len(sent)

22

In [9]:
# replace
# lower
# upper
# find
# concatenate strings
# length

In [ ]:
# String Indexing
# Postive Indexing
# Negative Indexing

In [ ]:
# Slicing
# Positive
# Negative
# Step Index based

In [ ]:
# Searching a String
# find() finds the first occurrence of the substring
# If the substring is not found, find() returns -1

In [ ]:
# Replace

In [ ]:
# User Input
# Write a program to prompt the user for hours and rate per hour to compute gross pay.

In [99]:
"hello" * 3

'hellohellohello'

In [ ]:
# Given a string, return a string where for every character in the original there are three characters
# 'hello' -----------> 'hhheeellllllooo'

In [102]:
s = ""
for i in "hello":
    s = s + (i * 3)
    print(s, end="\n")

hhh
hhheee
hhheeelll
hhheeellllll
hhheeellllllooo

In [ ]:
# Looping and Counting
# count the number of 'a's in alphabets

In [ ]:
# Given a input string,If the string length is less than 3, print string is too short.
# If not create a string made up  of the first 3 and the last 3 chars from a given input string.

In [4]:
# range

In [5]:
# Lists
# collection objects
# Mutable objects
# Ordered

In [103]:
list1 = list()
list1 = []

In [105]:
list1 = [1, 2, 2.5, True, "hai", [1, 2, 3]]
type(list1)

list

In [107]:
list1[5][2]

3

In [109]:
list1[-1][-1]

3

In [110]:
list1.append(9)
list1

[1, 2, 2.5, True, 'hai', [1, 2, 3], 9]

In [111]:
list1.append([1, 9])
list1

[1, 2, 2.5, True, 'hai', [1, 2, 3], 9, [1, 9]]

In [112]:
list1.extend([1, 9])
list1

[1, 2, 2.5, True, 'hai', [1, 2, 3], 9, [1, 9], 1, 9]

In [106]:
# append
# extend
# insert
# pop
# remove

In [ ]:
# Suppose you are given a list of numbers. You need to find the corresponding squares of these numbers
# save it to a new list

In [115]:
list1 = [1, 2, 3, 4, 5]

In [116]:
list2 = []
for i in list1:
    list2.append(i**2)
list2

[1, 4, 9, 16, 25]

In [117]:
[i**2 for i in list1]  # list comprehension

[1, 4, 9, 16, 25]

In [118]:
# Write code to add ‘horseback riding’ to the third position (i.e., right before volleyball) in the list sports.
sports = [
    "cricket",
    "football",
    "volleyball",
    "baseball",
    "softball",
    "track and field",
    "curling",
    "ping pong",
    "hockey",
]

In [119]:
sports.insert(2, "horseback riding")
sports

['cricket',
 'football',
 'horseback riding',
 'volleyball',
 'baseball',
 'softball',
 'track and field',
 'curling',
 'ping pong',
 'hockey']

In [128]:
# Write code to take ‘London’ out of the list trav_dest.
trav_dest = [
    "Beirut",
    "Milan",
    "Pittsburgh",
    "Buenos Aires",
    "Nairobi",
    "Kathmandu",
    "Osaka",
    "London",
    "Melbourne",
]

In [120]:
list1

[1, 2, 3, 4, 5]

In [123]:
list1.pop(1)
list1

[1, 3]

In [129]:
trav_dest.remove("London")
trav_dest

['Beirut',
 'Milan',
 'Pittsburgh',
 'Buenos Aires',
 'Nairobi',
 'Kathmandu',
 'Osaka',
 'Melbourne']

#### Tuples

In [130]:
# In Python tuples are very similar to lists, however, unlike lists they are *immutable* meaning they can not be changed.
tup = ()
type(tup)

tuple

In [131]:
tup = tuple()
type(tup)

tuple

In [132]:
tup = (1, 2, [2, 3], "hai")

In [133]:
# immutable
tup[0] = 9

TypeError: 'tuple' object does not support item assignment

In [135]:
tup.index(2)

1

#### Set

In [4]:
# unordered collection of unique elements
# Sets cannot have duplicates.
s = set()

In [137]:
type(s)

set

In [138]:
s1 = {1, 2, 2, 4, 5, 6, 7, 7, 8}
s1

{1, 2, 4, 5, 6, 7, 8}

In [141]:
# Give a list  extract the unique elements from the list
li = [1, 2, 3, 3, 4, 5, 6, 6]
new = list(set(li))
new

[1, 2, 3, 4, 5, 6]

#### Dictionaries

In [ ]:
# A Python dictionary consists of a key and then an associated value.
# That value can be almost any Python object. So a dictionary object always has elements as key-value pairs
# keys() method returns the list of keys in the dictionary object
# values() method returns the list of values in the dictionary object
# items() method returns the list of the keys and values
# get() method takes the key as an argument and returns None if the key is not found in the dictionary.

In [5]:
bag = {"books": 2, "mobile": 1, "pens": 2}

In [6]:
dict1 = dict()
dict1 = {}

In [7]:
# Dictionaries are like bags - no order
bag.keys()

dict_keys(['books', 'mobile', 'pens'])

In [8]:
bag.values()

dict_values([2, 1, 2])

In [9]:
# Get the keys and their corresponding values
bag.items()

dict_items([('books', 2), ('mobile', 1), ('pens', 2)])

In [10]:
bag["books"]

2

In [11]:
bag.get("books")

2

In [12]:
bag["charger"] = 1
bag

{'books': 2, 'mobile': 1, 'pens': 2, 'charger': 1}

In [13]:
del bag["charger"]
bag

{'books': 2, 'mobile': 1, 'pens': 2}

In [16]:
bag["wallet"] = "new"
bag

{'books': 2, 'mobile': 1, 'pens': 2, 'wallet': 'new'}

In [49]:
# In Python a function is some reusable code that takes arguments(s) as input, does some computation,
# and then returns a result or results

In [ ]:
# def <function_name>(parameters):
# <statments 1>
# <statment 2>
# return

In [19]:
def evenodd(x):
    if x % 2 == 0:
        return "even"
    else:
        return "odd"

In [20]:
# even or odd function
evenodd(6)

'even'

In [21]:
# function for find the largest of 3 nos.
def largest(a, b, c):
    if (a > b) and (a > c):
        print(a)
    elif (b > c) and (b > a):
        print(b)
    else:
        print(c)

In [25]:
# multiple i/p arguments
# no i/p arguments
largest(10, 20, 30)

30

In [15]:
# Write a function to Extract a list of first letters of each word in the uppercase form from a sentence
# split()method

In [29]:
sent = "hello how are you"
sent.split("e", 1)

['h', 'llo how are you']

In [ ]:
out = ["H", "H", "A", "Y"]

In [32]:
def extractfirst(sentence):
    ans = []
    for i in sentence.split():
        ans.append(i[0].upper())
    return ans

In [36]:
def extractfirst1(sentence):
    return [i[0].upper() for i in sentence.split()]

In [37]:
extractfirst1(sent)

['H', 'H', 'A', 'Y']

In [16]:
# list comprehension

In [ ]:
# To fetch the cities whose length is greater than 6
# To print even numbers in a list

In [38]:
# lambda function- anonymous
add1 = lambda x, y: x + y

In [39]:
add1(9, 8)

17

In [40]:
list1 = [1, 2, 3, 4, 5, 6]

In [45]:
list(map(lambda x: x**2, list1))

[1, 4, 9, 16, 25, 36]

In [46]:
# While Loop
# Print i as long as i is less than 5
i = 0
while i < 5:
    print(i)
    i += 1

0
1
2
3
4

- Introduction to Python Programming: Data Types, Input/Output, basic functions
- Control Structures: Conditional and Looping structures, User defined functions
- Data Structures in Python: Strings, Lists
- Advanced data structures: Tuple, Set, Dictionary

# **Numpy**

* NumPy stands for Numerical Python and 
* Numpy is linear algebra library for python.
* Numpy is incredibly fast.
* NumPy handles large datasets effectively and efficiently
* Provides support for **large multidimensional array objects**.

  **Array**
  * Arrays are a collection of elements/values, that can have one or more dimensions. 
    * An array of one dimension is called a **Vector** 
    * while having two dimensions is called a **Matrix**.

* NumPy arrays are called **ndarray** or **N-dimensional arrays** and 

                    *They store elements of the same type*

Note:
> Numpy is know for **high-performance** and 
> provides **efficient storage and data operations** as *arrays grow in size.*

#### Creating ndarrays

- 1D arrays can be be described simply by the number of values they contain.
- The dimensions of a 2D array are described by the number of rows and columns in the array.numpy describes 2D arrays by first listing the number of rows then the number columns.
- The dimensions of a 3D array are described by the number of layers the array contains, and the number of rows and columns in each layer. All layers must have the same number of rows and columns. numpy reports the shape of 3D arrays in the order layers, rows, column

###  **Size of NumPy array**
* determine how many values there are in the array using the size attribute
*  It just multiplies the number of ***rows*** by the number of ***columns*** in the ndarray:

![image.png]()

####  **. Creating 1D NumPy Array**

In [47]:
import numpy as np

In [48]:
a = np.array([1, 2, 3, 4, 5, 6])
a

array([1, 2, 3, 4, 5, 6])

In [49]:
a.ndim

1

In [50]:
a.shape

(6,)

In [51]:
b = np.array([[1, 2, 3], [4, 5, 6]])
b

array([[1, 2, 3],
       [4, 5, 6]])

In [52]:
b.ndim

2

In [53]:
b.shape

(2, 3)

In [54]:
b.size

6

**If heterogenous data entered?**

* values will be upcast if the types do not match:

In [63]:
b = np.array([[1, 2.5, 3], [4, 5, 6]])
b

array([[1. , 2.5, 3. ],
       [4. , 5. , 6. ]])

In [64]:
type(b)

numpy.ndarray

In [62]:
b.dtype

dtype('int32')

#### Creating array of zeros and ones

In [58]:
np.zeros(4)

array([0., 0., 0., 0.])

In [59]:
np.zeros((2, 4))

array([[0., 0., 0., 0.],
       [0., 0., 0., 0.]])

In [60]:
np.ones(5)

array([1., 1., 1., 1., 1.])

In [ ]:
# 20 to 10 using arange

In [65]:
np.arange(20, 9, -1)

array([20, 19, 18, 17, 16, 15, 14, 13, 12, 11, 10])

In [9]:
# Another method
# Reshape arrays

In [67]:
np.arange(1, 9).reshape(2, 4)

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [72]:
np.arange(1, 9).reshape(-1, 4)

array([[1, 2, 3, 4],
       [5, 6, 7, 8]])

In [ ]:
# Arithmetic operations

In [74]:
b.mean()

3.5833333333333335

In [75]:
np.mean(b)

3.5833333333333335

### Pandas

- An open-source library used for working with relational or labeled
- Provides various data structures and operations for manipulating numerical data and time series, as well as cleaning and data processing tools
- Supports two data structures:
   - Series
   - Dataframe

In [76]:
#### Pandas datastructures

## Series
# Creating series
# append
# drop
import pandas as pd

In [85]:
a = pd.Series([10, 20, 304, 60], index=["a", "b", "c", "d"])
a

a     10
b     20
c    304
d     60
dtype: int64

In [78]:
type(a)

pandas.core.series.Series

In [79]:
a.dtype

dtype('int64')

In [82]:
a["k"] = 100
a

a     10
b     20
c    304
d     60
k    100
dtype: int64

In [88]:
new = pd.Series([1, 2, 7])
pd.concat([a, new])

a     10
b     20
c    304
d     60
0      1
1      2
2      7
dtype: int64

In [90]:
a = a.drop("d")
a

a     10
b     20
c    304
dtype: int64

In [91]:
a.drop("c", inplace=True)
a

a    10
b    20
dtype: int64

In [ ]:
### Dataframe from a dictionary of lists
# iloc and loc

In [94]:
df = pd.DataFrame(
    {"Items": list("abcde"), "Price": [100, 200, 300, 400, 500]}, index=list("qwert")
)
df

  Items  Price
q     a    100
w     b    200
e     c    300
r     d    400
t     e    500

In [95]:
# iloc -index based
# loc-label based
df.iloc[0:3, 1]

q    100
w    200
e    300
Name: Price, dtype: int64

In [96]:
df.iloc[3:, :]

  Items  Price
r     d    400
t     e    500

In [98]:
df.loc[["q", "t"], ["Price"]]

   Price
q    100
t    500

In [99]:
import os

os.getcwd()

'D:\\B2B\\DELOITTE\\Webinar-Python'

In [100]:
df = pd.read_csv("audit.csv")

In [101]:
df.head()

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours
0,1004641,38,Private,College,Unmarried,Service,81838.00,Female,0.0,72
1,1010229,35,Private,Associate,Absent,Transport,72099.00,Male,0.0,30
2,1024587,32,Private,HSgrad,Divorced,Clerical,154676.74,Male,0.0,40
3,1038288,45,Private,Bachelor,Married,Repair,27743.82,Male,0.0,55
4,1044221,60,Private,College,Married,Executive,7568.23,Male,0.0,40

In [103]:
df.tail(2)

,ID,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours
1998,9991103,34,Private,College,Unmarried,Sales,113425.67,Male,0.0,45
1999,9996101,26,Private,HSgrad,Absent,Clerical,139984.58,Female,0.0,35

In [105]:
df.shape

(2000, 10)

In [106]:
df.shape[0]

2000

In [107]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          2000 non-null   int64
 1   Age         2000 non-null   int64
 2   Employment  1900 non-null   object
 3   Education   2000 non-null   object
 4   Marital     2000 non-null   object
 5   Occupation  1899 non-null   object
 6   Income      2000 non-null   float64
 7   Gender      2000 non-null   object
 8   Deductions  2000 non-null   float64
 9   Hours       2000 non-null   int64
dtypes: float64(2), int64(3), object(5)
memory usage: 156.4+ KB

In [109]:
df.dtypes

ID              int64
Age             int64
Employment     object
Education      object
Marital        object
Occupation     object
Income        float64
Gender         object
Deductions    float64
Hours           int64
dtype: object

In [108]:
df.isnull().sum()

ID              0
Age             0
Employment    100
Education       0
Marital         0
Occupation    101
Income          0
Gender          0
Deductions      0
Hours           0
dtype: int64

In [110]:
df.describe()

                 ID          Age         Income   Deductions        Hours
count  2.000000e+03  2000.000000    2000.000000  2000.000000  2000.000000
mean   5.624348e+06    38.622000   84688.460045    67.568333    40.074500
std    2.581118e+06    13.584748   69621.644503   340.704705    12.153716
min    1.004641e+06    17.000000     609.720000     0.000000     1.000000
25%    3.437052e+06    28.000000   34433.117500     0.000000    38.000000
50%    5.638451e+06    37.000000   59768.950000     0.000000    40.000000
75%    7.876535e+06    48.000000  113842.897500     0.000000    45.000000
max    9.996101e+06    90.000000  481259.500000  2904.000000    99.000000

In [111]:
df.describe(include="object")

       Employment Education  Marital Occupation Gender
count        1900      2000     2000       1899   2000
unique          8        16        6         14      2
top       Private    HSgrad  Married  Executive   Male
freq         1411       660      917        289   1368

In [112]:
df["Employment"].value_counts()

Private       1411
Consultant     148
PSLocal        119
SelfEmp         79
PSState         72
PSFederal       69
Unemployed       1
Volunteer        1
Name: Employment, dtype: int64

In [113]:
df[["Employment", "Education"]]

      Employment  Education
0        Private    College
1        Private  Associate
2        Private     HSgrad
3        Private   Bachelor
4        Private    College
...          ...        ...
1995     Private     HSgrad
1996  Consultant  Associate
1997     Private   Bachelor
1998     Private    College
1999     Private     HSgrad

[2000 rows x 2 columns]

In [117]:
df["Age"] = df["Age"].astype("float")

In [118]:
df.dtypes

ID              int64
Age           float64
Employment     object
Education      object
Marital        object
Occupation     object
Income        float64
Gender         object
Deductions    float64
Hours           int64
dtype: object

In [121]:
df.drop(columns="ID", inplace=True)

In [122]:
df.head(2)

,Age,Employment,Education,Marital,Occupation,Income,Gender,Deductions,Hours
0,38.0,Private,College,Unmarried,Service,81838.0,Female,0.0,72
1,35.0,Private,Associate,Absent,Transport,72099.0,Male,0.0,30

In [127]:
df.groupby("Occupation").agg({"Income": np.mean, "Age": "max"})

                     Income   Age
Occupation
Cleaner        99215.863626  70.0
Clerical      115569.382112  75.0
Executive      66151.717405  81.0
Farming        81638.138448  69.0
Home          119096.842000  48.0
Machinist      90908.712734  69.0
Military      104833.650000  23.0
Professional   81157.084858  76.0
Protective     68562.508500  83.0
Repair         61449.191822  68.0
Sales          86910.444563  79.0
Service       105971.928905  82.0
Support        85818.843673  66.0
Transport      58667.976355  70.0

In [126]:
df.groupby("Occupation")["Income"].mean()

Occupation
Cleaner          99215.863626
Clerical        115569.382112
Executive        66151.717405
Farming          81638.138448
Home            119096.842000
Machinist        90908.712734
Military        104833.650000
Professional     81157.084858
Protective       68562.508500
Repair           61449.191822
Sales            86910.444563
Service         105971.928905
Support          85818.843673
Transport        58667.976355
Name: Income, dtype: float64